//ผลลัพธ์ทั้ง console.log ทั้งสามคืออะไร
let name1 = 'Codecamp';
console.log(`hello ${1}`);  //hello 1
console.log(`hello ${'name1'}`);  //hello name
console.log(`hello ${name1}`);  //hello Codecamp

//ตัวแปรและประเภทของข้อมูล (Exercise 2)
//กำหนดตัวแปรสำหรับเก็บชื่อ และกำหนดค่าเริ่มต้นเป็นชื่อของผู้เรียน
let name = 'พรสุดา';
//กำหนดตัวแปรสำหรับเก็บอายุ และกำหนดค่าเริ่มต้นเป็นอายุของผู้เรียน
let age = 27;
//กำหนดตัวแปรสำหรับเก็บที่อยู่ และกำหนดค่าเริ่มต้นเป็นที่อยู่ของผู้เรียน
let addr = 'สมุทราปราการ';
//กำหนดตัวแปรสำหรับเก็บประวัติของนักเรียนโดยใช้ตัวแปรทั้ง 3 ตัวด้านบนประกอบการเขียนประวัตินี้ด้วย
console.log(`ชื่อ ${name}  อายุ ${age} ปี ที่อยู่ ${addr}`);